.. _acn_userguide:

Australian Company Numbers
==========================

Introduction
------------

The function :func:`clean_au_acn() <dataprep.clean.clean_au_acn.clean_au_acn>` cleans a column containing Australian Company Number (ACN) strings, and standardizes them in a given format. The function :func:`validate_au_acn() <dataprep.clean.clean_au_acn.validate_au_acn>` validates either a single ACN strings, a column of ACN strings or a DataFrame of ACN strings, returning `True` if the value is valid, and `False` otherwise.

ACN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "004085616"
* `standard`: ACN strings with proper whitespace in the proper places, like "004 085 616"
* `abn`: convert the number to an Australian Business Number (ABN) in compact format, like "53004085616".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_au_acn()` and `validate_au_acn()`.

### An example dataset containing ACN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "acn": [
            "004 085 616",
            "010 499 966",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

           acn                                           address
0  004 085 616                                     123 Pine Ave.
1  010 499 966                                           main st
2  999 999 999                      1234 west main heights 57033
3    004085616                    apt 1 789 s maple rd manhattan
4  002 724 334                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_au_acn`

By default, `clean_au_acn` will clean acn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_au_acn
clean_au_acn(df, column = "acn")

           acn                                           address    acn_clean
0  004 085 616                                     123 Pine Ave.  004 085 616
1  010 499 966                                           main st  010 499 966
2  999 999 999                      1234 west main heights 57033          NaN
3    004085616                    apt 1 789 s maple rd manhattan  004 085 616
4  002 724 334                robie house, 789 north main street  002 724 334
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_au_acn(df, column = "acn", output_format="standard")

           acn                                           address    acn_clean
0  004 085 616                                     123 Pine Ave.  004 085 616
1  010 499 966                                           main st  010 499 966
2  999 999 999                      1234 west main heights 57033          NaN
3    004085616                    apt 1 789 s maple rd manhattan  004 085 616
4  002 724 334                robie house, 789 north main street  002 724 334
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `compact`

In [4]:
clean_au_acn(df, column = "acn", output_format="compact")

           acn                                           address  acn_clean
0  004 085 616                                     123 Pine Ave.  004085616
1  010 499 966                                           main st  010499966
2  999 999 999                      1234 west main heights 57033        NaN
3    004085616                    apt 1 789 s maple rd manhattan  004085616
4  002 724 334                robie house, 789 north main street  002724334
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7         NULL                                             hello        NaN

### `abn`

In [5]:
clean_au_acn(df, column = "acn", output_format="abn")

           acn                                           address    acn_clean
0  004 085 616                                     123 Pine Ave.  53004085616
1  010 499 966                                           main st  25010499966
2  999 999 999                      1234 west main heights 57033          NaN
3    004085616                    apt 1 789 s maple rd manhattan  53004085616
4  002 724 334                robie house, 789 north main street  43002724334
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned ACN strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_au_acn(df, column="acn", inplace=True)

     acn_clean                                           address
0  004 085 616                                     123 Pine Ave.
1  010 499 966                                           main st
2          NaN                      1234 west main heights 57033
3  004 085 616                    apt 1 789 s maple rd manhattan
4  002 724 334                robie house, 789 north main street
5          NaN         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_au_acn(df, "acn", errors="coerce")

           acn                                           address    acn_clean
0  004 085 616                                     123 Pine Ave.  004 085 616
1  010 499 966                                           main st  010 499 966
2  999 999 999                      1234 west main heights 57033          NaN
3    004085616                    apt 1 789 s maple rd manhattan  004 085 616
4  002 724 334                robie house, 789 north main street  002 724 334
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `ignore`

In [8]:
clean_au_acn(df, "acn", errors="ignore")

           acn                                           address    acn_clean
0  004 085 616                                     123 Pine Ave.  004 085 616
1  010 499 966                                           main st  010 499 966
2  999 999 999                      1234 west main heights 57033  999 999 999
3    004085616                    apt 1 789 s maple rd manhattan  004 085 616
4  002 724 334                robie house, 789 north main street  002 724 334
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 4. `validate_au_acn()`

`validate_au_acn()` returns `True` when the input is a valid ACN. Otherwise it returns `False`.

The input of `validate_au_acn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_au_acn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_au_acn()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_au_acn
print(validate_au_acn("004 085 616"))
print(validate_au_acn("010 499 966"))
print(validate_au_acn("999 999 999"))
print(validate_au_acn("51824753556"))
print(validate_au_acn("004085616"))
print(validate_au_acn("hello"))
print(validate_au_acn(np.nan))
print(validate_au_acn("NULL"))

True
True
False
False
True
False
False
False

### Series

In [10]:
validate_au_acn(df["acn"])

0     True
1     True
2    False
3     True
4     True
5    False
6    False
7    False
Name: acn, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_au_acn(df, column="acn")

0     True
1     True
2    False
3     True
4     True
5    False
6    False
7    False
Name: acn, dtype: bool

### Only DataFrame

In [12]:
validate_au_acn(df)

     acn  address
0   True    False
1   True    False
2  False    False
3   True    False
4   True    False
5  False    False
6  False    False
7  False    False